#+title: Emacs Config
#+STARTUP: overview
#+HTML_HEAD: <link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css">

Denne Emacs-konfigurasjonen baserer seg på [[https://github.com/doomemacs/doomemacs][Doom Emacs]]-rammeverket, som deler inn all konfigurasjon til ~init.el~, ~packages.el~, og ~config.el~.

Dette er en [[https://orgmode.org/manual/Extracting-Source-Code.html][literal konfigurasjonsfil]], som betyr at all konfigurasjon defineres i denne artikkelen, også hentes innholdet i kodeblokkene her ut til de riktige konfigfilene når man ønsker å oppdatere. Med andre ord skriver man README-en først, også utgår all konfig automatisk ut fra den. 

** Størrelse på vinduet ved oppstart

Dette er for å få Emacs til å starte opp med en hensiktsmessig størrelse på vinduet, slik at jeg slipper å resize-e det hver gang Emacs starter opp. 

For å se størrelsen på vinduet akkurat nå, kan man evaluere denne:

#+begin_src emacs-lisp
(format "Width: %d, Height: %d" (frame-width) (frame-height))
#+end_src

#+RESULTS:
: Width: 95, Height: 50

WSL og Linux oppfører seg forskjellig, så de trenger hver sin setting:

#+begin_src emacs-lisp :tangle ~/repos/dotfiler/doom/config.el
(cond
 ;; ---  WSL  ---
 ((and (eq system-type 'gnu/linux) (getenv "WSLENV"))
  (add-to-list 'initial-frame-alist '(width . 95))
  (add-to-list 'initial-frame-alist '(height . 50)))

 ;; --- Linux ---
 ((eq system-type 'gnu/linux)
  (add-to-list 'initial-frame-alist '(width . 83))
  (add-to-list 'initial-frame-alist '(height . 43))))
#+end_src

Ved første øyekast ser det ut som om vinduet settes til å være nesten dobbelt så bredt som det er høyt, før man skjønner at høyden oppgis i linjer, og bredden oppgis i antall characters.

Det gir mening når man får høre at Emacs måler alt i tekst, og rektangelet som omslutter en bokstav på datamaskiner er mye høyere enn det er bredt.


** Gjennomsiktig bakgrunn og dimming

Alle kule utviklere har delvis gjennomsiktig bakgrunn

~add-to-list~ er der for å gi samme transparens til sekundære Emacs-vinduer, eller "frames" i Emacs-sjargong. Det skjer ikke så ofte, men f.eks. Emacs Everywhere-buffervinduer er selvstående vinduer som ikke blir transparente uten denne innstillingen

Det var nå jeg måtte lære meg hva en "frame" er, i tillegg til "window" og "buffer" 

#+begin_src emacs-lisp :tangle ~/repos/dotfiler/doom/config.el
(set-frame-parameter (selected-frame) 'alpha '(95 . 95))
(add-to-list 'default-frame-alist '(alpha . (95 . 95)))
#+end_src

#+RESULTS:
: ((alpha 96 . 96) (buffer-predicate . doom-buffer-frame-predicate) (right-divider-width . 1) (bottom-divider-width . 1) (alpha 94 . 94) (vertical-scroll-bars) (tool-bar-lines . 0) (menu-bar-lines . 0) (left-fringe . 8) (right-fringe . 8))

